Repository: mirpuertas/mediary
Catalog: lib/l10n/app_*.arb
Languages: es

# medicationGroupDetailDeleteGroupTooltip
source: Delete group
es: Eliminar grupo

# medicationGroupDetailNoMembers
source: No medications assigned
es: Sin medicamentos asignados

# medicationGroupDetailNoReminders
source: No reminders
es: Sin recordatorios

# addReminderSelectMedicationError
source: ❌ Select a medication
es: ❌ Seleccioná un medicamento

# addReminderSelectAtLeastOneDayError
source: ❌ Select at least one day
es: ❌ Seleccioná al menos un día

# addReminderCreated
source: {icon} Reminder created
es: {icon} Recordatorio creado

# addReminderUpdated
source: {icon} Reminder updated
es: {icon} Recordatorio actualizado

# addReminderTitleNew
source: ➕ New reminder
es: ➕ Nuevo recordatorio

# addReminderTitleEdit
source: ✏️ Edit reminder
es: ✏️ Editar recordatorio

# addReminderMedicationLabel
source: Medication
es: Medicamento

# addReminderTimeTitle
source: Reminder time
es: Hora del recordatorio

# addReminderDaysOfWeekTitle
source: Days of the week
es: Días de la semana

# addReminderNoteHint
source: e.g. After eating, with water...
es: Ej: Después de comer, con agua...

# addReminderExactAlarmTitle
source: This medication requires precision (like an alarm clock)
es: Este medicamento requiere precisión (como despertador)

# addReminderExactAlarmSubtitle
source: It rings even if the phone is idle. Special permissions are required.
es: Suena aunque el celular esté en reposo. Necesita permisos especiales.

# addReminderDndWarning
source: ⚠️ If you use "Do Not Disturb", this reminder may not ring. To make it work like an alarm clock, make sure alarms are allowed for this app in Sound settings.
es: ⚠️ Si usas "No Molestar", este recordatorio puede no sonar. Para que funcione como despertador, asegurate de permitir alarmas para esta app en Ajustes de Sonido.

# addReminderSaveButton
source: Save reminder
es: Guardar recordatorio

# addReminderUpdateButton
source: Update reminder
es: Actualizar recordatorio

# quickIntakeSelectAtLeastOneMedication
source: Select at least one medication
es: Selecciona al menos un medicamento

# quickIntakeAutoLoggedWithoutDose
source: Logged automatically (no dose)
es: Registrado automáticamente (sin dosis)

# quickIntakeMissingDefaultDose
source: No default dose: {names}
es: Sin dosis por defecto: {names}

# quickIntakeSaved
source: ✅ Intake logged
es: ✅ Toma registrada

# quickIntakeMedicationNotFound
source: Medication not found
es: Medicamento no encontrado

# quickIntakeSnoozed
source: ⏰ Reminder snoozed {minutes} min
es: ⏰ Recordatorio pospuesto {minutes} min

# quickIntakeDefaultGroupName
source: Medication group
es: Grupo de medicación

# quickIntakeAppBarSingle
source: 💊 Reminder
es: 💊 Recordatorio

# quickIntakeNoActiveMeds
source: No active medications for this reminder
es: No hay medicamentos activos para este recordatorio

# quickIntakeUnitLabel
source: Unit: {unit}
es: Unidad: {unit}

# quickIntakeWhatToDo
source: What would you like to do?
es: ¿Qué quieres hacer?

# quickIntakeIHaveTaken
source: I’ve taken it
es: Ya tomé

# quickIntakeSnooze10m
source: Snooze 10 minutes
es: Posponer 10 minutos

# quickIntakeSnooze1h
source: Snooze 1 hour
es: Posponer 1 hora

# quickIntakeChooseTaken
source: Choose what you took
es: Elige cuáles tomaste

# quickIntakeSelectedCount
source: {selected}/{total} selected
es: {selected}/{total} seleccionados

# quickIntakeSaveSelectedClose
source: Save selected (close)
es: Guardar seleccionadas (cerrar)

# quickIntakeRemainingHint
source: The remaining {remaining} won’t be notified again automatically. If you want another alert later, use “Snooze remaining”.
es: Las {remaining} restantes no se vuelven a avisar automáticamente. Si quieres que te notifique más tarde, usa “Posponer restantes”.

# quickIntakeSnoozeRemaining10m
source: Snooze remaining 10m
es: Posponer restantes 10m

# quickIntakeSnoozeRemaining1h
source: Snooze remaining 1h
es: Posponer restantes 1h

# dailyEntryTitle
source: Log your day
es: Registrar tu día

# dailyEntryTabDayOptional
source: Day (optional)
es: Día (opcional)

# dailyEntryTabSleepOptional
source: Sleep (optional)
es: Sueño (opcional)

# dailyEntryTabMedication
source: Medication
es: Medicación

# dailyEntryMedicationAdded
source: Medication added
es: Medicación agregada

# dailyEntrySaveError
source: Error saving
es: Error al guardar

# dailyEntrySaveErrorWithMessage
source: Error saving: {error}
es: Error al guardar: {error}

# dailyEntrySaveSuccess
source: Entry saved successfully
es: Registro guardado correctamente

# dayTabHeader
source: Day {date}
es: Día {date}

# dayTabOptionalHint
source: Optional. If you prefer, you can leave everything empty.
es: Opcional. Si no quieres, puedes dejar todo vacío.

# dayTabMoodTitle
source: Mood
es: Ánimo

# dayTabMoodQuestion
source: How are you feeling today?
es: Cómo te sientes hoy?

# dayTabMoodVeryBad
source: Very bad
es: Muy mal

# dayTabMoodBad
source: Bad
es: Mal

# dayTabMoodOk
source: Okay
es: Regular

# dayTabMoodGood
source: Good
es: Bien

# dayTabMoodVeryGood
source: Very good
es: Muy bien

# dayTabDayNotesTitle
source: Day notes
es: Notas del día

# dayTabDayNotesHint
source: Something to remember about the day...
es: Algo para recordar sobre el día...

# dayTabHabitsTitle
source: Habits
es: Hábitos

# dayTabWaterTitle
source: Water
es: Agua

# dayTabWaterCount
source: Glasses: {count}
es: Vasos: {count}

# dayTabWaterCountLabel
source: Water: {count}
es: Agua: {count}

# dayTabBlocksWalkedTitle
source: Blocks walked
es: Cuadras caminadas

# dayTabBlocksWalkedHint
source: e.g. 12
es: Ej: 12

# dayTabBlocksWalkedHelper
source: Approx. 0–1000
es: 0–1000 aprox.

# sleepTabNightOf
source: Night of {date}
es: Noche del {date}

# sleepTabHowDidYouSleep
source: How did you sleep?
es: Cómo dormiste?

# sleepTabHowLongDidYouSleep
source: How long did you sleep?
es: ¿Cuánto dormiste?

# sleepTabHours
source: Hours
es: Horas

# sleepTabMinutes
source: Minutes
es: Minutos

# sleepTabHowWasSleep
source: How was your sleep?
es: ¿Cómo fue el sueño?

# sleepTabContinuityStraight
source: Uninterrupted
es: De corrido

# sleepTabContinuityBroken
source: Interrupted
es: Cortado

# sleepTabOptionalHint
source: Optional: if you prefer, leave it empty.
es: Opcional: si no quieres, déjalo vacío.

# sleepTabGeneralNotesOptional
source: General notes (optional)
es: Notas generales (opcional)

# sleepTabNotesHint
source: Something to remember tomorrow...
es: Algo para recordar mañana...

# medicationTabExpandAll
source: Expand all
es: Expandir todo

# medicationTabCollapseAll
source: Collapse all
es: Contraer todo

# medicationTabEmptyTitle
source: No medications logged
es: Sin medicamentos registrados

# medicationTabEmptySubtitle
source: Press the + button to add one
es: Presiona el botón + para agregar

# medicationTabAddMedication
source: Add medication
es: Agregar medicación

# medicationTabDoseApplication
source: Application
es: Aplicación

# medicationTabDropsDose
source: {count, plural, one{1 drop} other{{count} drops}}
es: {count, plural, one{1 gota} other{{count} gotas}}

# medicationTabCapsulesDose
source: {count, plural, one{1 capsule} other{{count} capsules}}
es: {count, plural, one{1 cápsula} other{{count} cápsulas}}

# medicationTabCustomQuantityTitle
source: Custom amount
es: Cantidad personalizada

# medicationTabMedicationLabel
source: Medication
es: Medicamento

# medicationTabAddAnotherMedication
source: + Add another
es: + Agregar otro

# medicationTabDoseDropsLabel
source: Number of drops
es: Cantidad de gotas

# medicationTabDoseCapsulesLabel
source: Number of capsules
es: Cantidad de cápsulas

# medicationTabNoteOptionalLabel
source: Note (optional)
es: Nota (opcional)

# medicationTabNoteHint
source: Effects, context...
es: Efectos, contexto...

# homeTitle
source: Journal
es: Diario

# homeTooltipSummary
source: Summary
es: Resumen

# homeTooltipMedications
source: Medications
es: Medicamentos

# homeTooltipSettings
source: Settings
es: Ajustes

# homeCalendarViewTooltip
source: View
es: Vista

# homeCalendarFilterTooltip
source: Filter
es: Filtrar

# homeCalendarMonth
source: Month
es: Mes

# homeCalendarTwoWeeks
source: 2 weeks
es: 2 semanas

# homeCalendarWeek
source: Week
es: Semana

# homeRemindersTodayTitle
source: Today's reminders
es: Recordatorios de hoy

# homeRemindersSnoozedHeader
source: Snoozed
es: Pospuestos

# summaryTitle
source: Summary
es: Resumen

# summaryLoadError
source: Could not load the summary.
es: No se pudo cargar el resumen.

# summaryLastNDays
source: Last {days} days
es: Últimos {days} días

# summaryTabStats
source: Stats
es: Estadísticas

# summaryTabPatterns
source: Patterns
es: Patrones

# summaryViewDayByDay
source: View day-by-day details →
es: Ver detalle día por día →

# summaryPatternsRangeHint
source: Relationships available over 30 and 90 days.
es: Relaciones disponibles en 30 y 90 días.

# summarySleepAverageQuality
source: Average sleep quality
es: Promedio de calidad de sueño

# summarySleepNoRecords
source: No sleep records in this period
es: Sin registros de sueño en este período

# summaryMoodNoRecords
source: No mood records in this period
es: Sin registros de ánimo en este período

# summaryMoodMostFrequentPrefix
source: The most frequent mood was
es: El ánimo más frecuente fue

# summaryMedicationDaysWith
source: Days with medication logged: {withCount} out of {total}
es: Días con medicación registrada: {withCount} de {total}

# summaryDaysWithoutRecord
source: Days without a record: {days}
es: Días sin registro: {days}

# summaryPatternsStreaks
source: Streaks
es: Rachas

# summaryPatternsGoals
source: Goals
es: Metas

# summaryStreakCurrent
source: Current: {value}
es: Actual: {value}

# summaryStreakBest
source: Best: {value}
es: Mejor: {value}

# summaryGoalDaysProgress
source: {achieved}/{total} days
es: {achieved}/{total} días

# summaryInsightsDisclaimer
source: These are comparisons within the selected period (they do not imply causation).
es: Son comparaciones dentro del período (no implican causalidad).

# summaryInsightStrengthNotEnoughData
source: Not enough data
es: Sin datos

# summaryInsightStrengthWeak
source: Weak
es: Débil

# summaryInsightStrengthPreliminary
source: Preliminary
es: Preliminar

# summaryInsightStrengthModerate
source: Moderate
es: Moderada

# summaryInsightStrengthStrong
source: Strong
es: Fuerte

# summaryDaysWithRecordLabel
source: Days with a record (of {rangeDays}):
es: Días con registro (de {rangeDays}):

# summaryAvgShortWithValue
source: Avg: {value}
es: Prom: {value}

# summaryBlocksWalkedDays
source: Blocks walked: {days}
es: Cuadras caminadas: {days}

# summaryWaterDays
source: 💧 Water: {days}
es: 💧 Agua: {days}

# summarySleepTrendHigherAtEnd
source: Sleep quality was higher toward the end of the period
es: La calidad de sueño fue más alta hacia el final del período

# summarySleepTrendHigherAtStart
source: Sleep quality was higher toward the beginning of the period
es: La calidad de sueño fue más alta hacia el inicio del período

# summaryPatternWaterGoal
source: 💧 Water ≥6
es: 💧 Agua ≥6

# summaryPatternSleepGoal
source: 🛏️ Sleep ≥4
es: 🛏️ Sueño ≥4

# summaryPatternMoodGoal
source: 😊 Mood ≥4
es: 😊 Ánimo ≥4

# summaryMetricSleep
source: sleep
es: sueño

# summaryMetricMood
source: mood
es: ánimo

# summaryMetricWater
source: water
es: agua

# summaryInsightTitleSleepMood
source: Sleep ↔ Mood
es: Sueño ↔ Ánimo

# summaryInsightTitleWaterMood
source: Water ↔ Mood
es: Agua ↔ Ánimo

# summaryInsightDirHigher
source: higher
es: más alto

# summaryInsightDirLower
source: lower
es: más bajo

# summaryInsightBaseMinPairs
source: Base: {pairCount} days (minimum: {minPairs})
es: Base: {pairCount} días (mínimo: {minPairs})

# summaryInsightMessageMinPairs
source: Preliminary: there are too few days with both data points logged to compare.
es: Preliminar: hay pocos días con ambos datos cargados para comparar.

# summaryInsightBaseNoGroup
source: Base: {pairCount} days
es: Base: {pairCount} días

# summaryInsightMessageNoGroup
source: Preliminary: there isn’t enough data to group.
es: Preliminar: no hay suficientes datos para agrupar.

# summaryInsightGroupHintShort
source: days with more {xLabel} vs less {xLabel}
es: días con más {xLabel} vs menos {xLabel}

# summaryInsightGroupHintLong
source: best vs worst ~30% (by {xLabel})
es: mejores vs peores ~30% (según {xLabel})

# summaryInsightBaseTopBottom
source: Base: {pairCount} days · {groupHint} · groups: {g} and {g}
es: Base: {pairCount} días · {groupHint} · grupos: {g} y {g}

# summaryInsightMessageTopBottom
source: On your days with higher {xLabel}, {yLabel} tends to be {dirWord} (Δ {delta}).
es: En tus días con {xLabel} más alto, {yLabel} tiende a ser {dirWord} (Δ {delta}).

# selectedDayDeleteTooltip
source: Delete day entry
es: Eliminar registro del día

# selectedDayDeleteDialogTitle
source: Delete entry
es: Eliminar registro

# selectedDayDeleteDialogBody
source: Delete the FULL entry for this day? This will delete: sleep, medication (intakes), mood, and notes.
es: ¿Eliminar el registro COMPLETO de este día? Se borrarán: sueño, medicación (tomas), ánimo y notas.

# selectedDayChipSleepWithQuality
source: Sleep: {quality}/5
es: Sueño: {quality}/5

# selectedDayChipSleepEmpty
source: Sleep: —
es: Sueño: —

# selectedDayChipMedicationWithCount
source: Medication: {count}
es: Medicación: {count}

# selectedDayChipMedicationEmpty
source: Medication: —
es: Medicación: —

# selectedDayNoMoodRecorded
source: No mood recorded
es: Sin ánimo registrado

# selectedDayNoWater
source: No water
es: Sin agua

# selectedDayBlocksWalkedValue
source: Blocks walked: {value}
es: Cuadras caminadas: {value}

# selectedDayNoBlocksWalked
source: No blocks walked recorded
es: Sin cuadras caminadas registradas

# selectedDayNoSleepRecord
source: No sleep record
es: Sin registro de sueño

# selectedDayMedicationsTitle
source: Medications
es: Medicaciones

# selectedDayNoMedications
source: No medications logged
es: Sin medicaciones registradas

# selectedDayMedicationFallbackName
source: Medication {id}
es: Medicamento {id}

# selectedDayMedicationQtyLabelRecord
source: Record
es: Registro

# commonBack
source: Back
es: Atrás

# commonNext
source: Next
es: Siguiente

# commonSkip
source: Skip
es: Omitir

# commonSaving
source: Saving…
es: Guardando…

# welcomeStart
source: Get started
es: Comenzar

# welcomePage1Title
source: Your daily journal, effortlessly
es: Tu registro diario, sin esfuerzo

# welcomePage1Body
source: Log medication, sleep, and day notes in seconds.
es: Anota medicación, sueño y notas del día en pocos segundos.

# welcomePage2Title
source: Reminders, if you need them
es: Recordatorios, si los necesitas

# welcomePage2Body
source: Schedule alarms for your doses, or just use it to log.
es: Programa alarmas para tus tomas o úsalo solo para registrar.

# welcomePage3Title
source: Your history in a calendar
es: Tu historial en calendario

# welcomePage3Body
source: You’ll be able to see logged days and spot patterns over time.
es: Vas a poder ver días registrados y detectar patrones con el tiempo.

# welcomePage4Title
source: Everything stays on your phone
es: Todo queda en tu teléfono

# welcomePage4Body
source: Stored locally. No accounts, no servers, no internet.
es: Se guarda localmente. Sin cuentas, sin servidores, sin internet.

# appLockBiometricReason
source: Authentication required
es: Autenticación requerida

# setPinTitleCreate
source: Create PIN
es: Crear PIN

# setPinTitleChange
source: Change PIN
es: Cambiar PIN

# setPinEnterCurrentPinError
source: Enter your current PIN (4 digits)
es: Ingresa tu PIN actual (4 dígitos)

# setPinInvalidPinError
source: Your PIN must be 4 digits
es: El PIN debe tener 4 dígitos

# setPinPinsDoNotMatch
source: PINs do not match
es: Los PIN no coinciden

# setPinTooManyAttemptsSeconds
source: Too many attempts. Wait {seconds}s
es: Demasiados intentos. Espera {seconds}s

# setPinCurrentPinIncorrect
source: Current PIN is incorrect
es: PIN actual incorrecto

# setPinCurrentPinLabel
source: Current PIN
es: PIN actual

# setPinNewPinLabel
source: New PIN (4 digits)
es: Nuevo PIN (4 dígitos)

# setPinConfirmNewPinLabel
source: Confirm new PIN
es: Confirmar nuevo PIN

# lockScreenEnterPinTitle
source: Enter your PIN
es: Ingresa tu PIN

# lockScreenPinHint
source: 4 digits
es: 4 dígitos

# lockScreenLockedOut
source: Locked for security. Try again at {time}
es: Bloqueado por seguridad. Intenta de nuevo en {time}

# lockScreenTooManyAttempts
source: Too many attempts. Wait {time}
es: Demasiados intentos. Espera {time}

# lockScreenPinIncorrectAttemptsLeft
source: Incorrect PIN. Attempts left: {left}
es: PIN incorrecto. Intentos restantes: {left}

# lockScreenUseBiometrics
source: Use fingerprint
es: Usar huella digital

# dailyEntryValidationFutureDay
source: You can’t log a future day.
es: No se puede registrar un día futuro.

# dailyEntryValidationSelectMedication
source: Please select the medication in event {index}
es: Por favor selecciona el medicamento en el evento {index}

# dailyEntryValidationGelNoQuantity
source: Gel entries don’t record a quantity. Leave “No dose” for event {index}.
es: Para gel no se registra cantidad. Deja “Sin dosis” en el evento {index}.

# dailyEntryValidationInvalidQuantityInteger
source: The quantity in event {index} is invalid. Choose “No dose” or a valid integer.
es: La cantidad del evento {index} es inválida. Elige “Sin dosis” o un entero válido.

# dailyEntryValidationInvalidQuantityFraction
source: The quantity in event {index} is invalid. Choose “No dose” or a valid fraction.
es: La cantidad del evento {index} es inválida. Elige “Sin dosis” o una fracción válida.

# dailyEntryValidationSleepNeedsQuality
source: To save sleep, choose “How did you sleep” (1–5) or clear the details.
es: Para guardar el sueño, elige “Cómo dormiste” (1–5) o borra los detalles.

# medicationTypeTablet
source: tablet
es: comprimido

# medicationTypeDrops
source: drops
es: gotas

# medicationTypeCapsule
source: capsule
es: cápsula

# medicationTypeGel
source: gel/cream
es: gel/crema

# backupShareSubject
source: Mediary backup ({date})
es: Copia de seguridad Mediary ({date})

# backupShareText
source: Mediary data backup.
es: Copia de seguridad de mis datos de Mediary.

# backupInvalidFileFormat
source: Invalid file format
es: Formato de archivo inválido

# backupNewerThanApp
source: This backup was created with a newer app version. Please update the app.
es: Versión de backup más reciente que la app. Actualizá la app.

# exportSectionSleep
source: Sleep log
es: Registro de sueño

# exportSectionMedications
source: Medication log
es: Registro de medicaciones

# exportSectionDay
source: Day log
es: Registro del día

# exportSleepHeaderNight
source: Night
es: Noche

# exportSleepHeaderQuality
source: Quality
es: Calidad

# exportSleepHeaderDescription
source: Description
es: Descripción

# exportSleepHeaderHours
source: Hours
es: Horas

# exportSleepHeaderHow
source: How
es: Cómo

# exportSleepHeaderComments
source: Comments
es: Comentarios

# exportSleepContinuityContinuous
source: Continuous
es: Continuo

# exportSleepContinuityBroken
source: Interrupted
es: Cortado

# exportSleepQualityVeryBad
source: Very bad
es: Muy mal

# exportSleepQualityBad
source: Bad
es: Mal

# exportSleepQualityOk
source: Okay
es: Regular

# exportSleepQualityGood
source: Good
es: Bien

# exportSleepQualityVeryGood
source: Very good
es: Muy bien

# exportMedicationHeaderDay
source: Day
es: Día

# exportMedicationHeaderTime
source: Time
es: Hora

# exportMedicationHeaderMedication
source: Medication
es: Medicamento

# exportMedicationHeaderUnit
source: Unit
es: Unidad

# exportMedicationHeaderQuantity
source: Quantity
es: Cantidad

# exportMedicationHeaderNote
source: Note
es: Nota

# exportMedicationHeaderNotes
source: Notes
es: Notas

# exportMedicationApplication
source: Application
es: Aplicación

# exportMedicationFallback
source: Medication {id}
es: Medicamento {id}

# exportShareCsv
source: CSV export
es: Exportación CSV

# exportShareSleepAnalyticsCsv
source: Analytics export: sleep.csv
es: Exportación para analítica: sleep.csv

# exportShareMedicationsAnalyticsCsv
source: Analytics export: medications.csv
es: Exportación para analítica: medications.csv

# exportShareExcel
source: Excel export (.xlsx)
es: Exportación Excel (.xlsx)

# exportSharePdf
source: PDF export
es: Exportación PDF

# exportFileBaseDiary
source: journal_medications
es: diario_medicamentos

# exportSheetSleep
source: Sleep
es: Sueño

# exportSheetMedications
source: Medications
es: Medicaciones

# exportSheetDay
source: Day
es: Día

# exportDayHeaderDate
source: Date
es: Fecha

# exportDayHeaderMood
source: Mood
es: Ánimo

# exportDayHeaderBlocksWalked
source: Blocks walked
es: Cuadras caminadas

# exportDayHeaderWater
source: Water
es: Agua

# exportDayHeaderDayNotes
source: Day notes
es: Notas del día

# exportDayHeaderDayNotesAbbrev
source: Day notes
es: Notas día

# exportErrorExcelGeneration
source: Could not generate the Excel file
es: No se pudo generar el archivo Excel

# exportPdfTitle
source: Journal (Sleep + Medication + Day)
es: Diario (Sueño + Medicación + Día)

# exportPdfExportedAt
source: Exported: {timestamp}
es: Exportado: {timestamp}

# exportPdfSectionSleep
source: Sleep log
es: Registro de Sueño

# exportPdfSectionMedications
source: Medication journal
es: Diario de Medicaciones

# exportPdfSectionDay
source: Day log
es: Registro del Día
