Repository: mirpuertas/mediary
Catalog: lib/l10n/app_*.arb
Languages: es

# splashSubtitle
source: Your daily health journal
es: Tu registro diario de salud

# commonCancel
source: Cancel
es: Cancelar

# commonContinue
source: Continue
es: Continuar

# commonNotNow
source: Not now
es: Ahora no

# commonUnderstood
source: Understood
es: Entendido

# commonAdd
source: Add
es: Agregar

# commonEdit
source: Edit
es: Editar

# commonSave
source: Save
es: Guardar

# commonAccept
source: Accept
es: Aceptar

# commonCreate
source: Create
es: Crear

# commonArchive
source: Archive
es: Archivar

# commonUnarchive
source: Unarchive
es: Desarchivar

# commonDeletePermanently
source: Delete permanently
es: Eliminar definitivamente

# commonDelete
source: Delete
es: Eliminar

# commonAll
source: All
es: Todo

# commonNone
source: None
es: Nada

# commonIgnore
source: Ignore
es: Ignorar

# commonActive
source: Active
es: Activos

# commonArchived
source: Archived
es: Archivados

# commonChooseRange
source: Choose range
es: Elegir rango

# commonAreYouSure
source: Are you sure?
es: ¿Seguro?

# commonNotRecorded
source: Not recorded
es: Sin registrar

# commonClear
source: Clear
es: Borrar

# commonDecrease
source: Decrease
es: Bajar

# commonIncrease
source: Increase
es: Subir

# commonRefresh
source: Refresh
es: Actualizar

# commonRange
source: Range
es: Rango

# commonAverage
source: Average
es: Promedio

# commonDaysLabel
source: Days
es: Días

# commonEveryDay
source: Every day
es: Todos los días

# commonDetailsOptional
source: Details (optional)
es: Detalles (opcional)

# commonNoteSaved
source: Note saved
es: Nota guardada

# commonIncomplete
source: Incomplete
es: Sin completar

# commonSelect
source: Select
es: Seleccionar

# commonNote
source: Note
es: Nota

# commonNoteOptionalLabel
source: Note (optional)
es: Nota (opcional)

# commonTime
source: Time
es: Hora

# commonQuantity
source: Quantity
es: Cantidad

# commonNoMedication
source: No medication
es: Sin medicamento

# commonNoDose
source: No dose
es: Sin dosis

# commonNoDoseWithDash
source: No dose (—)
es: Sin dosis (—)

# commonSleep
source: Sleep
es: Sueño

# commonMood
source: Mood
es: Ánimo

# commonHabits
source: Habits
es: Hábitos

# commonMedication
source: Medication
es: Medicación

# commonMedications
source: Medications
es: Medicamentos

# commonReminders
source: Reminders
es: Recordatorios

# commonGroup
source: Group
es: Grupo

# commonExactAlarm
source: ⏰ Exact alarm
es: ⏰ Alarma exacta

# commonDay
source: Day
es: Día

# commonNoNotes
source: No notes
es: Sin notas

# permissionsNotificationsDisabledTitle
source: Notifications disabled
es: Notificaciones desactivadas

# permissionsNotificationsDisabledBody
source: To make reminders work, enable notifications in your system settings. This allows alerts to be shown at the scheduled time.
es: Para que los recordatorios funcionen, activa las notificaciones en Ajustes del sistema. Esto permite mostrar avisos en la hora programada.

# permissionsExactAlarmsTitle
source: Allow exact alarms
es: Permitir alarmas exactas

# permissionsExactAlarmsBody
source: This reminder needs to ring at the exact time. Enable "Alarms & reminders" for this app. If you don't, the alert may arrive late.
es: Este recordatorio necesita sonar a la hora exacta. Activa "Alarmas y recordatorios" para esta app. Si no lo activas, el aviso puede llegar con demora.

# permissionsBatteryRecommendationTitle
source: Battery recommendation
es: Recomendación de batería

# permissionsBatteryRecommendationBody
source: This device ({manufacturer}) may restrict apps running in the background. If your notifications don’t arrive, disable battery optimization for this app: Settings → Battery → Unrestricted / Don’t optimize
es: Este equipo ({manufacturer}) a veces restringe apps en segundo plano. Si tus notificaciones no llegan, desactiva la optimización de batería para esta app: Ajustes → Batería → Sin restricciones / No optimizar

# notificationsDailyChannelName
source: Daily reminder
es: Recordatorio diario

# notificationsDailyChannelDescription
source: Reminder to log your sleep every day
es: Recordatorio para registrar el sueño diariamente

# notificationsMedicationChannelName
source: Medication reminders
es: Recordatorios de medicación

# notificationsMedicationChannelDescription
source: Alarms to take medications
es: Alarmas para tomar medicamentos

# notificationsDailySleepTitle
source: 🌙 Sleep log
es: 🌙 Registro de sueño

# notificationsDailySleepBody
source: How did you sleep last night? Log your sleep
es: ¿Cómo dormiste anoche? Registra tu sueño

# notificationsTestTitle
source: Test notification
es: Notificación de prueba

# notificationsTestBody
source: This is a test notification. If you see it, it works!
es: Esta es una notificación de prueba. Si la ves, ¡funciona!

# notificationsMedicationTitle
source: 💊 Medication reminder
es: 💊 Recordatorio de medicación

# notificationsSnoozedTitle
source: 💊 Reminder (snoozed)
es: 💊 Recordatorio (pospuesto)

# notificationsTapToLogBody
source: Tap to log
es: Tocar para registrar

# notificationsMedicationFallbackName
source: medication
es: medicamento

# notificationsTakeMedicationBody
source: Take {name}
es: Tomar {name}

# notificationsTakeMedicationsBody
source: Take: {names}
es: Tomar: {names}

# notificationsActionChoose
source: 📝 Choose
es: 📝 Elegir

# notificationsActionSnooze5min
source: ⏰ Snooze 5 min
es: ⏰ Posponer 5 min

# notificationsActionCompleteTaken
source: ✅ Done
es: ✅ Hecho

# notificationsActionCompleteAllTaken
source: ✅ All done
es: ✅ Hecho

# notificationsAutoLogged
source: Logged automatically
es: Registrado automáticamente

# notificationsAutoLoggedWithApplication
source: Logged automatically (application)
es: Registrado automáticamente (aplicación)

# notificationsErrorReminderMissingId
source: The reminder must have a database ID
es: El recordatorio debe tener un ID de base de datos

# notificationsErrorGroupReminderMissingId
source: The group reminder must have a DB ID
es: El recordatorio de grupo debe tener un ID de DB

# notificationsErrorProcessing
source: Error processing notification: {error}
es: Error al procesar notificación: {error}

# settingsTitle
source: Settings
es: Configuración

# settingsSectionAppearance
source: Appearance
es: Apariencia

# settingsSectionSecurity
source: Security
es: Seguridad

# settingsSectionReminders
source: Reminders
es: Recordatorios

# settingsSectionExportData
source: Export Data
es: Exportar Datos

# settingsSectionExportAnalytics
source: Export for Analytics
es: Exportar para analítica

# settingsSectionDataBackups
source: Data & Backups
es: Datos y Copias de Seguridad

# settingsSectionInfo
source: Information
es: Información

# settingsSectionDanger
source: Danger Zone
es: Zona de peligro

# settingsDarkModeTitle
source: Dark Mode
es: Modo oscuro

# settingsDarkModeUsingSystem
source: Using system theme
es: Usando el tema del sistema

# commonDark
source: Dark
es: Oscuro

# commonLight
source: Light
es: Claro

# settingsPinLockTitle
source: PIN Lock
es: Bloqueo con PIN

# settingsPinLockSubtitle
source: Require PIN to enter the app
es: Pide PIN para entrar a la app

# settingsChangePinTitle
source: Change PIN
es: Cambiar PIN

# settingsChangePinSubtitle
source: 4-digit PIN
es: PIN de 4 dígitos

# settingsPinUpdated
source: PIN updated
es: PIN actualizado

# settingsLockOnReturnTitle
source: Lock on return
es: Bloquear al volver

# settingsLockOnReturnDialogTitle
source: Lock when returning from background
es: Bloquear al volver de background

# settingsLockTimeoutImmediateBack
source: Immediate on return
es: Inmediato al volver

# settingsLockTimeout30Seconds
source: 30 seconds
es: 30 segundos

# settingsLockTimeout2Minutes
source: 2 minutes
es: 2 minutos

# settingsLockTimeout5Minutes
source: 5 minutes
es: 5 minutos

# settingsLockTimeoutImmediate
source: Immediate
es: Inmediato

# settingsBiometricTitle
source: Biometric authentication
es: Autenticación biométrica

# settingsBiometricAvailableSubtitle
source: Use fingerprint or Face ID
es: Usar huella digital o Face ID

# settingsBiometricUnavailableSubtitle
source: Not available on this device
es: No disponible en este dispositivo

# settingsBiometricNotSupported
source: Your device doesn’t support biometric authentication
es: Tu dispositivo no soporta autenticación biométrica

# settingsDbEncryptionTitle
source: Database encryption
es: Cifrado de base de datos

# settingsDbEncryptionSubtitle
source: Protects your local data if the phone is stolen
es: Protege tus datos locales si te roban el teléfono

# settingsDbEncryptionStatusOn
source: On
es: Activado

# settingsDbEncryptionStatusOff
source: Off
es: Desactivado

# settingsDbEncryptionStatusUnknown
source: Unknown
es: Desconocido

# settingsDbEncryptionRecommendAppLockTitle
source: Recommended: enable App Lock
es: Recomendado: activar Bloqueo de app

# settingsDbEncryptionRecommendAppLockBody
source: Encryption protects the DB file, but anyone with your unlocked phone could open the app. App Lock adds a second barrier.
es: El cifrado protege el archivo de la DB, pero si el teléfono está desbloqueado cualquiera podría abrir la app. El Bloqueo agrega una barrera extra.

# settingsDbEncryptionEnableAppLockAction
source: Enable
es: Activar

# settingsDisableAppLockWarningTitle
source: Disable App Lock?
es: ¿Desactivar el bloqueo de app?

# settingsDisableAppLockWarningBody
source: Your database is encrypted, but disabling App Lock may expose your data to anyone who has your unlocked phone.
es: Tu base de datos está cifrada, pero desactivar el bloqueo puede exponer tus datos a cualquiera que tenga tu teléfono desbloqueado.

# settingsDisableAppLockWarningDisable
source: Disable
es: Desactivar

# settingsNotificationsPermissionTitle
source: Notifications permission
es: Permiso de notificaciones

# settingsNotificationsPermissionBody
source: Notifications are disabled. To enable them, go to the app settings.
es: Las notificaciones están desactivadas. Para activarlas, ve a Configuración de la aplicación.

# settingsOpenSettings
source: Open settings
es: Abrir configuración

# settingsNotificationsPermissionDisabledTitle
source: Notifications permission disabled
es: Permiso de notificaciones desactivado

# settingsNotificationsPermissionDisabledBody
source: Reminders won’t work until you enable the permission.
es: Los recordatorios no funcionarán hasta que actives el permiso.

# settingsEnableNotificationsPermissionTitle
source: Enable notifications permission
es: Activar permiso de notificaciones

# settingsEnableNotificationsPermissionSubtitle
source: Open system settings
es: Abrir configuración del sistema

# settingsExactAlarmsPermissionDisabledTitle
source: Exact alarms permission disabled
es: Permiso de alarmas exactas desactivado

# settingsExactAlarmsPermissionDisabledBody
source: The sleep reminder needs this permission to ring on time on Android 12+.
es: El recordatorio de sueño necesita este permiso para sonar a tiempo en Android 12+.

# settingsAllowExactAlarmsTitle
source: Allow exact alarms
es: Permitir alarmas exactas

# settingsAllowExactAlarmsSubtitle
source: Required for precise reminders
es: Requerido para recordatorios precisos

# settingsDailyReminderTitle
source: Daily reminder
es: Recordatorio diario

# settingsDailyReminderSubtitle
source: Notification to log your sleep
es: Notificación para registrar tu sueño

# settingsLanguageTitle
source: Language
es: Idioma

# settingsLanguageSystem
source: Automatic (system)
es: Automático (sistema)

# settingsReminderTimeTitle
source: Reminder time
es: Hora del recordatorio

# settingsReminderSetFor
source: Reminder set for {time}
es: Recordatorio configurado para las {time}

# settingsExportDialogTitle
source: Export data
es: Exportar datos

# settingsExportDialogBody
source: Do you want to export all data or choose a date range?
es: ¿Quieres exportar todos los datos o elegir un rango de fechas?

# settingsExportSelectRangeHelpText
source: Select the range to export
es: Selecciona el rango a exportar

# settingsExportPdfButton
source: Export to PDF
es: Exportar a PDF

# settingsExportExcelButton
source: Export to Excel (.xlsx)
es: Exportar a Excel (.xlsx)

# settingsExportNoData
source: No data to export. Log a few days first.
es: No hay datos para exportar. Registra algunos días primero.

# settingsExportSleepRecordsTitle
source: Sleep records
es: Registros de sueño

# settingsExportMedicationEventsTitle
source: Logged intakes
es: Tomas registradas

# settingsExportDateRangeTitle
source: Date range
es: Rango de fechas

# settingsExportError
source: Error exporting {type}: {error}
es: Error al exportar {type}: {error}

# settingsBackupCreateTitle
source: Create backup
es: Crear copia de seguridad

# settingsBackupCreateSubtitle
source: Export a file for reinstall
es: Exportar archivo para reinstalación

# settingsBackupRestoreTitle
source: Restore backup
es: Restaurar copia de seguridad

# settingsBackupRestoreSubtitle
source: Import a previous file
es: Importar archivo previo

# settingsBackupCreateError
source: Error creating backup: {error}
es: Error al crear backup: {error}

# settingsBackupRestoreConfirmTitle
source: Restore backup
es: Restaurar copia de seguridad

# settingsBackupRestoreConfirmBody
source: ⚠️ WARNING: This will delete all current data and replace it with the backup file. Do you want to continue?
es: ⚠️ ALERTA: Esto eliminará todos los datos actuales y los reemplazará con los del archivo de respaldo. ¿Deseas continuar?

# settingsBackupRestoreConfirmYes
source: Yes, restore
es: Sí, restaurar

# backupPasswordTitleCreate
source: Encrypt backup (optional)
es: Cifrar backup (opcional)

# backupPasswordHintCreate
source: Leave empty to export without encryption.
es: Deja vacío para exportar sin cifrar.

# backupPasswordTitleRestore
source: Backup password
es: Contraseña del backup

# backupPasswordHintRestore
source: Enter the password used when the backup was created.
es: Ingresa la contraseña usada al crear el backup.

# backupPasswordLabel
source: Password
es: Contraseña

# backupPasswordConfirmLabel
source: Confirm password
es: Confirmar contraseña

# backupPasswordMismatch
source: Passwords do not match.
es: Las contraseñas no coinciden.

# backupPasswordRequired
source: Password required.
es: La contraseña es obligatoria.

# backupPasswordInvalid
source: Incorrect password.
es: Contraseña incorrecta.

# settingsBackupRestoreCompleted
source: Restore completed. Restarting...
es: Restauración completada. Reiniciando...

# settingsBackupRestoreError
source: Error restoring: {error}
es: Error al restaurar: {error}

# settingsAboutTitle
source: About
es: Acerca de

# settingsPrivacyInfoTitle
source: Privacy
es: Privacidad

# settingsPrivacyInfoSubtitle
source: All your data is stored locally on your device
es: Todos tus datos se guardan localmente en tu dispositivo

# settingsWipeAllTitle
source: Factory reset
es: Borrado total

# settingsWipeAllSubtitle
source: Delete all data from this device
es: Eliminar todos los datos del dispositivo

# settingsWipeAllDialogBody
source: This will delete ALL data stored on this device:
es: Esto eliminará TODOS tus datos guardados en el dispositivo:

# settingsWipeAllItemMedications
source: • Medications (active and archived)
es: • Medicamentos (activos y archivados)

# settingsWipeAllItemMedicationReminders
source: • Medication reminders
es: • Recordatorios de medicación

# settingsWipeAllItemIntakes
source: • Logged intakes
es: • Tomas registradas

# settingsWipeAllItemSleepEntries
source: • Sleep records
es: • Registros de sueño

# settingsWipeAllItemAppSettings
source: • App settings and state
es: • Configuración y estado de la app

# settingsWipeAllAcknowledge
source: I understand this action is irreversible
es: Entiendo que esta acción es irreversible

# settingsWipeAllSuccess
source: Data deleted successfully
es: Datos eliminados correctamente

# settingsWipeAllError
source: Error deleting data: {error}
es: Error al borrar datos: {error}

# medicationsTitle
source: Medications
es: Medicamentos

# medicationsGroupButton
source: Group
es: Agrupar

# medicationsEmptyTitle
source: No medications
es: No hay medicamentos

# medicationsEmptySubtitle
source: Add one using the + button
es: Agrega uno con el botón +

# medicationsArchivedSectionTitle
source: Archived ({count})
es: Archivados ({count})

# medicationsUnarchiveButton
source: Restore
es: Reactivar

# medicationsAddButton
source: Add
es: Agregar

# medicationsDialogAddTitle
source: Add medication
es: Agregar medicamento

# medicationsDialogEditTitle
source: Edit medication
es: Editar medicamento

# medicationsGenericNameLabel
source: Generic name *
es: Nombre genérico *

# medicationsGenericNameHint
source: e.g. Ibuprofen
es: Ej: Ibuprofeno

# medicationsGenericNameRequired
source: Generic name is required
es: El nombre genérico es obligatorio

# medicationsBrandNameLabel
source: Brand name (optional)
es: Nombre comercial (opcional)

# medicationsBrandNameHint
source: e.g. Advil
es: Ej: Ibupirac

# medicationsBaseUnitLabel
source: Base unit *
es: Unidad base *

# medicationsBaseUnitHint
source: e.g. 1 mg, 2 mg, 10 ml
es: Ej: 1mg, 2mg, 10ml

# medicationsBaseUnitRequired
source: Base unit is required
es: La unidad base es obligatoria

# medicationsTypeLabel
source: Type *
es: Tipo *

# medicationsDefaultDoseOptional
source: Default dose (optional)
es: Dosis habitual (opcional)

# medicationsDefaultDoseQtyDrops
source: Default amount (drops)
es: Cantidad habitual (gotas)

# medicationsDefaultDoseQtyCapsules
source: Default amount (capsules)
es: Cantidad habitual (cápsulas)

# medicationsDefaultDoseQtyLabel
source: Default amount
es: Cantidad habitual

# medicationsDefaultDosePickerTitle
source: Default dose
es: Dosis habitual

# medicationsDefaultDoseCustom
source: Custom…
es: Personalizada…

# medicationsDefaultDoseHelper
source: This amount will be prefilled when logging intakes
es: Esta cantidad se precargará al registrar tomas

# medicationsSavedAdded
source: Medication added
es: Medicamento agregado

# medicationsSavedUpdated
source: Medication updated
es: Medicamento actualizado

# medicationsDuplicateWarning
source: A similar medication already exists. You can edit it from the list.
es: Ya existe una medicación igual cargada. Puedes editarla desde la lista.

# medicationsDbError
source: Database error: {error}
es: Error de base de datos: {error}

# medicationsManageTitle
source: Manage medication
es: Gestionar medicamento

# medicationsManageBody
source: Choose what you want to do: • Archive: keeps historical records and pauses reminders. • Delete permanently: deletes the medication and all associated records.
es: Elige qué quieres hacer: • Archivar: no borra registros históricos y pausa recordatorios. • Eliminar definitivamente: borra el medicamento y todos sus registros asociados.

# medicationsArchivedSnack
source: Medication archived
es: Medicamento archivado

# medicationsArchiveError
source: Error archiving: {error}
es: Error al archivar: {error}

# medicationsHardDeleteTitle
source: Delete permanently
es: Eliminar definitivamente

# medicationsHardDeleteBody
source: This action CANNOT be undone. The following will be deleted: • {name} • all associated history • reminders Do you want to continue?
es: Esta acción NO se puede deshacer. Se eliminará: • {name} • todos los registros históricos asociados • recordatorios ¿Quieres continuar?

# medicationsDeletedSnack
source: Medication deleted permanently
es: Medicamento eliminado definitivamente

# medicationsDeleteError
source: Error deleting: {error}
es: Error al eliminar: {error}

# medicationsUnarchiveTitle
source: Restore medication
es: Reactivar medicamento

# medicationsUnarchiveBody
source: Restore this medication? It will appear again in the list and selectors. Any configured reminders will be rescheduled.
es: ¿Reactivar este medicamento? Volverá a aparecer en la lista y en los selectores. Los recordatorios que tuviera configurados se reprogramarán.

# medicationsUnarchivedSnack
source: Medication restored
es: Medicamento reactivado

# medicationsRemindersTitle
source: Reminders
es: Recordatorios

# medicationsNoReminders
source: No reminders
es: Sin recordatorios

# medicationsTooltipViewReminders
source: View reminders
es: Ver recordatorios

# medicationsTooltipAdjustDose
source: Adjust dose
es: Ajustar dosis

# medicationsTooltipArchiveDelete
source: Archive / Delete
es: Archivar / Eliminar

# medicationsDeleteReminderTitle
source: Delete reminder
es: Eliminar recordatorio

# medicationsDeleteReminderBody
source: Are you sure you want to delete this reminder?
es: ¿Estás seguro de eliminar este recordatorio?

# medicationsReminderDeletedSnack
source: 🗑️ Reminder deleted
es: 🗑️ Recordatorio eliminado

# fractionPickerTitle
source: Amount
es: Cantidad

# fractionPickerWholeLabel
source: Whole
es: Enteros

# fractionPickerFractionLabel
source: Fraction
es: Fracción

# fractionPickerNoFractionSelected
source: No fraction
es: Sin fracción

# fractionPickerPreviewLabel
source: Preview:
es: Vista previa:

# medicationDetailLoadError
source: ❌ Error loading reminders: {error}
es: ❌ Error al cargar recordatorios: {error}

# medicationDetailDeleteReminderTitle
source: Delete reminder
es: Eliminar recordatorio

# medicationDetailDeleteReminderBody
source: Delete the {time} reminder?
es: ¿Eliminar el recordatorio de las {time}?

# medicationDetailReminderDeleted
source: ✅ Reminder deleted
es: ✅ Recordatorio eliminado

# medicationDetailDaysLabel
source: Days: {days}
es: Días: {days}

# medicationDetailSchedulesTitle
source: Schedule times
es: Horarios de toma

# medicationDetailSchedulesCount
source: {count, plural, one{1 time} other{{count} times}}
es: {count, plural, one{1 horario} other{{count} horarios}}

# medicationDetailNoRemindersTitle
source: No reminders set
es: Sin recordatorios configurados

# medicationDetailNoRemindersSubtitle
source: Press the + button to add one
es: Presiona el botón + para agregar uno

# medicationDetailAddSchedule
source: Add time
es: Agregar horario

# medicationGroupsTitle
source: Medication groups
es: Grupos de medicación

# medicationGroupsEmpty
source: You don’t have any groups yet
es: Todavía no tenés grupos

# medicationGroupsNewGroupTitle
source: New group
es: Nuevo grupo

# medicationGroupsNameLabel
source: Name
es: Nombre

# medicationGroupsNameHint
source: e.g. Night
es: Ej: Noche

# medicationGroupDetailGroupNotFound
source: Group not found
es: Grupo no encontrado

# medicationGroupDetailMembersDialogTitle
source: Group medications
es: Medicamentos del grupo

# medicationGroupDetailNewReminderTitle
source: ➕ New reminder
es: ➕ Nuevo recordatorio

# medicationGroupDetailEditReminderTitle
source: ✏️ Edit reminder
es: ✏️ Editar recordatorio

# medicationGroupDetailTimeLabel
source: Time: {time}
es: Hora: {time}

# medicationGroupDetailExactAlarmTitle
source: This group requires precision (like an alarm clock)
es: Este grupo requiere precisión (como despertador)

# medicationGroupDetailExactAlarmSubtitle
source: It rings even if the phone is idle. Special permissions are required.
es: Suena aunque el celular esté en reposo. Necesita permisos especiales.

# medicationGroupDetailDndWarning
source: ⚠️ If you use "Do Not Disturb", this reminder may not ring. To make it work like an alarm clock, make sure alarms are allowed for this app in Sound settings.
es: ⚠️ Si usas "No Molestar", este recordatorio puede no sonar. Para que funcione como despertador, asegurate de permitir alarmas para esta app en Ajustes de Sonido.

# medicationGroupDetailDeleteReminderTitle
source: Delete reminder
es: Eliminar recordatorio

# medicationGroupDetailDeleteGroupTitle
source: Delete group
es: Eliminar grupo

# medicationGroupDetailDeleteGroupBody
source: Its reminders will also be deleted.
es: Se eliminarán también sus recordatorios.
